app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
        # binding.pry
    posts = Post.all