app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("provider", "uid", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "name", "nickname", "image", "allow_password_change", "tokens", "created_at", "updated_at") VALUES ('email', 'soo@soo.com', 'soo@soo.com', '$2a$12$ybqXixbvjTUnHG5zStPloulHyFfYgUAhm29SYWKnl.2jNPnx/Fl2m', NULL, NULL, NULL, 'wUjrxpehnZSxcsf1znYz', NULL, '2025-01-28 10:12:02.356766', NULL, 'ali', NULL, NULL, 0, NULL, '2025-01-28 10:12:02.356687', '2025-01-28 10:12:02.356687') RETURNING "id"
INSERT INTO "users" ("provider", "uid", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "name", "nickname", "image", "allow_password_change", "tokens", "created_at", "updated_at") VALUES ('email', 'kashif.tufail19@gmail.com', 'kashif.tufail19@gmail.com', '$2a$12$OVkjKkPSlAN9yZtWkR4XQOIkduz0M/p2e7ETpqSsC5fJDBvMB7pUK', NULL, NULL, NULL, 'AxD2vGD9rxxdgdQr7Aeg', NULL, '2025-01-02 04:57:00.056661', NULL, 'Rush Order', NULL, NULL, 0, NULL, '2025-01-02 04:57:00.056550', '2025-01-02 04:57:00.056550') RETURNING "id"
---
    def create
      @user = User.new(sign_up_params)

      if @user.save
        # Send the token as part of the response
        token = @user.create_new_auth_token