app/controllers/users/sessions_controller.rb

    def create
      @user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'soo@soo.com' LIMIT 1